{
  "_id": {
    "$oid": "67d52faee4ab1294e7d86e2f"
  },
  "name": "create and start task",
  "description": "Creates a new task with multiple actions and start running the task. Use this when the request requires more than one step. You MUST include the user's request comprehensively, without losing any information. It has to retain 100% the user's requirement.",
  "type": "atomic",
  "execution_mode": "internal",
  "mode": "ALL",
  "code": "import json; import asyncio; import core.internal_action_interface as internal_action_interface; task_name=input_data['task_name']; task_description=input_data['task_description']; task_id=asyncio.run(internal_action_interface.InternalActionInterface.do_create_and_run_task(task_name, task_description)); output = json.dumps({'status':'ok','task_id':task_id})",
  "input_schema": {
    "task_name": {
      "type": "string",
      "example": "Literature review for state-of-the-art AI agent architecture and compile as PDF",
      "description": "The name of the task."
    },
    "task_description": {
      "type": "string",
      "example": "The user is asking for me to perform literature review for state-of-the-art AI agent architecture. Then, save the report in PDF format. Here is the original user's query: 'Hi agent, please perform literature review on the subject of the best AI agent architecture, and save the review into a report in PDF format. Thanks agent.'",
      "description": "Detailed instructions or steps for the task. you MUST include all instructions from the user query in the task instructure. Make it comprehensive without losing any information from the original user query. You MUST also copy the user query into the task_description. DO NOT create task plan here, because that will be handled outside of this action"
    }
  },
  "output_schema": {
    "status": {
      "type": "string",
      "example": "ok",
      "description": "Indicates the task creation was attempted."
    },
    "task_id": {
      "type": "string",
      "example": "user_request_1",
      "description": "The task ID used for this new task."
    }
  },
  "subActions": [],
  "default": false,
  "scope": [
    "global"
  ]
}
